# coding=windows-1251
# Задание 1
print("Введите стороны прямоугольника.")
print("Длина: ")
